CSI API ETABS v1
cPropLink.GetLinear Method
 Retrieves link property data for a linear-type link property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLinear(
	string Name,
	ref bool[] DOF,
	ref bool[] Fixed,
	ref double[] Ke,
	ref double[] Ce,
	ref double DJ2,
	ref double DJ3,
	ref bool KeCoupled,
	ref bool CeCoupled,
	ref string Notes,
	ref string GUID
)
Function GetLinear (
	Name As String,
	ByRef DOF As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Ke As Double(),
	ByRef Ce As Double(),
	ByRef DJ2 As Double,
	ByRef DJ3 As Double,
	ByRef KeCoupled As Boolean,
	ByRef CeCoupled As Boolean,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim DOF As Boolean()
Dim Fixed As Boolean()
Dim Ke As Double()
Dim Ce As Double()
Dim DJ2 As Double
Dim DJ3 As Double
Dim KeCoupled As Boolean
Dim CeCoupled As Boolean
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetLinear(Name,
	DOF, Fixed, Ke, Ce, DJ2, DJ3, KeCoupled,
	CeCoupled, Notes, GUID)
int GetLinear(
	String^ Name,
	array<bool>^% DOF,
	array<bool>^% Fixed,
	array<double>^% Ke,
	array<double>^% Ce,
	double% DJ2,
	double% DJ3,
	bool% KeCoupled,
	bool% CeCoupled,
	String^% Notes,
	String^% GUID
)
abstract GetLinear :
        Name : string *
        DOF : bool[] byref *
        Fixed : bool[] byref *
        Ke : float[] byref *
        Ce : float[] byref *
        DJ2 : float byref *
        DJ3 : float byref *
        KeCoupled : bool byref *
        CeCoupled : bool byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing linear-type link property.
DOF
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if properties exist for a specified degree of freedom.
Value | DOF
DOF(0) | U1
DOF(1) | U2
DOF(2) | U3
DOF(3) | R1
DOF(4) | R2
DOF(5) | R3
Fixed
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if the specified degree of freedom is fixed (restrained).
Value | Fixity
Fixed(0) | U1 fixity if DOF(0) = True
Fixed(1) | U2 fixity if DOF(1) = True
Fixed(2) | U3 fixity if DOF(2) = True
Fixed(3) | R1 fixity if DOF(3) = True
Fixed(4) | R2 fixity if DOF(4) = True
Fixed(5) | R3 fixity if DOF(5) = True
Ke
Type: System.Double[]
This is an array of stiffness terms for the link property. There are 6 terms in the array if the stiffness is uncoupled and 21 if it is coupled. The KeCoupled item indicates if the stiffness is coupled.
If the stiffness is uncoupled:
Value | Stiffness
Ke(0) | U1 [F/L]
Ke(1) | U2 [F/L]
Ke(2) | U3 [F/L]
Ke(3) | R1 [FL]
Ke(4) | R2 [FL]
Ke(5) | R3 [FL]
If the stiffness is coupled:
Value | Stiffness
Ke(0) | U1U1 [F/L]
Ke(1) | U1U2 [F/L]
Ke(2) | U2U2 [F/L]
Ke(3) | U1U3 [F/L]
Ke(4) | U2U3 [F/L]
Ke(5) | U3U3 [F/L]
Ke(6) | U1R1 [F]
Ke(7) | U2R1 [F]
Ke(8) | U3R1 [F]
Ke(9) | R1R1 [FL]
Ke(10) | U1R2 [F]
Ke(11) | U2R2 [F]
Ke(12) | U3R2 [F]
Ke(14) | R2R2 [FL]
Ke(15) | U1R3 [F]
Ke(16) | U2R3 [F]
Ke(17) | U3R3 [F]
Ke(18) | R1R3 [FL]
Ke(19) | R2R3 [FL]
Ke(20) | R3R3 [FL]
Ce
Type: System.Double[]
This is an array of damping terms for the link property. There are 6 terms in the array if the damping is uncoupled and 21 if it is coupled. The CeCoupled item indicates if the damping is coupled.
If the damping is uncoupled:
Value | Damping
Ce(0) | U1 [F/L]
Ce(1) | U2 [F/L]
Ce(2) | U3 [F/L]
Ce(3) | R1 [FL]
Ce(4) | R2 [FL]
Ce(5) | R3 [FL]
If the damping is coupled:
Value | Damping
Ce(0) | U1U1 [F/L]
Ce(1) | U1U2 [F/L]
Ce(2) | U2U2 [F/L]
Ce(3) | U1U3 [F/L]
Ce(4) | U2U3 [F/L]
Ce(5) | U3U3 [F/L]
Ce(6) | U1R1 [F]
Ce(7) | U2R1 [F]
Ce(8) | U3R1 [F]
Ce(9) | R1R1 [FL]
Ce(10) | U1R2 [F]
Ce(11) | U2R2 [F]
Ce(12) | U3R2 [F]
Ce(14) | R2R2 [FL]
Ce(15) | U1R3 [F]
Ce(16) | U2R3 [F]
Ce(17) | U3R3 [F]
Ce(18) | R1R3 [FL]
Ce(19) | R2R3 [FL]
Ce(20) | R3R3 [FL]
DJ2
Type: System.Double
The distance from the J-End of the link to the U2 shear spring. This item applies only when DOF(1) = True. [L]
DJ3
Type: System.Double
The distance from the J-End of the link to the U3 shear spring. This item applies only when DOF(2) = True. [L]
KeCoupled
Type: System.Boolean
This item is True if the link stiffness, Ke, is coupled. There are 21 terms in the Ke array if Ke is coupled; otherwise there are 6 terms
CeCoupled
Type: System.Boolean
This item is True if the link damping, Ce, is coupled. There are 21 terms in the Ce array if Ce is coupled; otherwise there are 6 terms
Notes
Type: System.String
The notes, if any, assigned to the property.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyDOF() As Boolean
       Dim MyFixed() As Boolean
       Dim MyKe() As Double
       Dim MyCe() As Double
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim Ke() As Double
       Dim Ce() As Double
       Dim dj2 As Double
       Dim dj3 As Double
       Dim KeCoupled As Boolean
       Dim CeCoupled As Boolean
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim MyDOF(5)
       ReDim MyFixed(5)
       ReDim MyKe(5)
       ReDim MyCe(5)
       MyDOF(0) = True
       MyKe(0) = 12
       ret = SapModel.PropLink.SetLinear("L1", MyDOF, MyFixed, MyKe, MyCe, 0, 0)
   'get link property data
       ret = SapModel.PropLink.GetLinear("L1", DOF, Fixed, Ke, Ce, dj2, dj3, KeCoupled, CeCoupled, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace